In [56]:
import sqlite3
import pandas as pd

# CONNECTION

In [39]:
conn = sqlite3.connect("afazeres.db")

# CREATE TABLE

In [40]:
conn.execute("""
    CREATE TABLE IF NOT EXISTS tasks
    (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        description TEXT,
        done INTEGER
    )    
""")
conn.commit()

# CREATE

In [60]:
conn.execute("""
    INSERT INTO tasks (description, done)
    VALUES ('Estudar seaborn', 0);    
""")
conn.commit()

# READ

In [72]:
results = conn.execute("""
    SELECT *
    FROM tasks
""").fetchall()
for result in results:
    print(result)

OperationalError: no such table: tasks

In [50]:
results = conn.execute("""
    SELECT description
    FROM tasks
    WHERE done=0
""").fetchall()
for result in results:
    print(result)

('Estudar pandas',)
('Lavar roupa',)

# UPDATE

In [51]:
conn.execute("""
    UPDATE tasks
    SET done=1
    WHERE id=3
""")
conn.commit()

# DELETE

In [53]:
conn.execute("""
    DELETE FROM tasks
    WHERE id=1
""")
conn.commit()

# Pandas query

In [66]:
df = pd.read_sql_query(
    """
       SELECT *
       FROM tasks
    """,
    conn
)
df

   id         description  done
0   2         Lavar louça     1
1   3         Lavar roupa     1
2   4      Estudar pandas     0
3   5      Estudar python     0
4   6  Estudar matplotlib     0
5   7     Estudar seaborn     0

# AGRUPAMENTO E AGREGAÇÃO

In [67]:
df['done'].value_counts()

0    4
1    2
Name: done, dtype: int64

In [70]:
results = conn.execute("""
    SELECT done, COUNT(*) AS done_tasks
    FROM tasks
    GROUP BY done;      
""").fetchall()

for result in results:
    print(result)

(0, 4)
(1, 2)

# DELETE TABLE

In [71]:
conn.execute("DROP TABLE tasks")
conn.commit()

# RELACIONAMENTO

In [73]:
conn.execute("""
    CREATE TABLE categories 
    (
      id    INTEGER PRIMARY KEY, 
      name  TEXT NOT NULL
    );
""")

conn.execute(
    """
        INSERT INTO categories (name)
        VALUES
          ('casa'),
          ('laser'),
          ('faculdade')
    """
)
conn.commit()

In [78]:
conn.execute("""
    CREATE TABLE tasks 
    (
      id            INTEGER PRIMARY KEY AUTOINCREMENT, 
      description   TEXT NOT NULL,
      done          INTEGER,
      category_id   INTEGER NOT NULL,
      FOREIGN KEY (category_id) REFERENCES categories (id)
    )
""")
conn.commit()

# JOIN

In [79]:
# insert many
conn.execute(
    """
    INSERT INTO 'tasks' (description, done, category_id)
    VALUES
      ('Assistir Netflix', 1, 2),
      ('Estudar matplotlib', 0, 3),
      ('Estudar seaborn', 0, 3),
      ('Estudar Pandas', 0, 3),
      ('Lavar louça', 0, 1)
    """
)
conn.commit()

In [82]:
tasks_with_categories = conn.execute(
    """
    SELECT t.id, t.description, t.done, c.name 
    FROM tasks AS t 
    INNER JOIN categories AS c
      ON c.id = t.category_id
    ORDER BY c.name
    """
).fetchall()

for task in tasks_with_categories:
    print(task)

(5, 'Lavar louça', 0, 'casa')
(2, 'Estudar matplotlib', 0, 'faculdade')
(3, 'Estudar seaborn', 0, 'faculdade')
(4, 'Estudar Pandas', 0, 'faculdade')
(1, 'Assistir Netflix', 1, 'laser')

# Close connection

In [83]:
conn.close()

# Exercícios

In [84]:
conn = sqlite3.connect('../datasets/chinook.db')

1. Fornecer uma consulta que mostre os clientes (apenas seus nomes completos, ID do cliente e país) que não estão nos EUA.

In [92]:
df = pd.read_sql_query(
    """
        SELECT FirstName || ' ' || LastName AS FullName, Country, CustomerId
        FROM customers
        WHERE Country <> 'USA'
    """,
    conn
)
df

                 FullName         Country  CustomerId
0          Luís Gonçalves          Brazil           1
1           Leonie Köhler         Germany           2
2       François Tremblay          Canada           3
3            Bjørn Hansen          Norway           4
4   František Wichterlová  Czech Republic           5
5             Helena Holý  Czech Republic           6
6           Astrid Gruber         Austria           7
7            Daan Peeters         Belgium           8
8            Kara Nielsen         Denmark           9
9         Eduardo Martins          Brazil          10
10        Alexandre Rocha          Brazil          11
11        Roberto Almeida          Brazil          12
12         Fernanda Ramos          Brazil          13
13           Mark Philips          Canada          14
14      Jennifer Peterson          Canada          15
15           Robert Brown          Canada          29
16         Edward Francis          Canada          30
17            Martha Silk          Canada          31
18         Aaron Mitchell          Canada          32
19         Ellie Sullivan          Canada          33
20         João Fernandes        Portugal          34
21       Madalena Sampaio        Portugal          35
22       Hannah Schneider         Germany          36
23        Fynn Zimmermann         Germany          37
24        Niklas Schröder         Germany          38
25        Camille Bernard          France          39
26     Dominique Lefebvre          France          40
27            Marc Dubois          France          41
28           Wyatt Girard          France          42
29       Isabelle Mercier          France          43
30       Terhi Hämäläinen         Finland          44
31        Ladislav Kovács         Hungary          45
32          Hugh O'Reilly         Ireland          46
33          Lucas Mancini           Italy          47
34  Johannes Van der Berg     Netherlands          48
35       Stanisław Wójcik          Poland          49
36          Enrique Muñoz           Spain          50
37       Joakim Johansson          Sweden          51
38             Emma Jones  United Kingdom          52
39            Phil Hughes  United Kingdom          53
40           Steve Murray  United Kingdom          54
41            Mark Taylor       Australia          55
42        Diego Gutiérrez       Argentina          56
43             Luis Rojas           Chile          57
44           Manoj Pareek           India          58
45        Puja Srivastava           India          59

In [ ]:
conn.execute("""
    
""")